<?php
/* vim: set expandtab tabstop=2 shiftwidth=2 softtabstop=2 foldmethod=marker: */
/**
 * Кофигурационный файл сообщений системы.
 *
 * @package Core
 * @subpackage Core
 * @author Konstantin Shamiev aka marko-polo <konstanta75@mail.ru>
 * @version 28.01.2010
 */
$subj_list = array();
$subj_list[0] = '! Не определнная ошибка !';
$subj_list[1] = 'Позиция добавлена';
$subj_list[2] = 'Позиция изменена';
$subj_list[3] = 'Позиция удалена';
$subj_list[4] = 'Связь с элементом добавлена';
$subj_list[5] = 'Связь с элементом удалена';
$subj_list[6] = 'Папка удалена со всем его содержимым';
$subj_list[7] = 'Файл удален';
$subj_list[8] = 'Файл загружен';
$subj_list[9] = 'Папка создана';
$subj_list[10] = 'Изменения сохранены';
$subj_list[11] = 'файл изменен';
$subj_list[12] = 'Заполните обязательные поля и сохраните для добавления';
$subj_list[13] = '';
$subj_list[14] = '';
$subj_list[15] = '';
$subj_list[16] = '';
$subj_list[17] = '';
$subj_list[18] = '';
$subj_list[19] = '';
$subj_list[20] = '';
$subj_list[50] = '! Вы не имеете прав на данную операцию !';
$subj_list[51] = '! Недостаточно данных для выполнения операции !';
$subj_list[52] = '! Удаление невозможно из-за наличия связей !';
$subj_list[53] = '! прямой доступ к объектам данного типа запрещен !';
$subj_list[54] = '! объекты данного типа не реализованы !';
$subj_list[55] = '! Попытка доступа к запрещенному объекту !';
$subj_list[56] = '! Файл не указан !';
$subj_list[57] = '! Файл не загружен !';
$subj_list[57] = '! Ошибка файла !';
$subj_list[58] = '! Не корректная работа модуля. Объект не определен. !';
$subj_list[59] = '! Доступ запрещен. !';
$subj_list[60] = '! Несанкционированный доступ. !';
$subj_list[61] = '! Данные не определены !';
$subj_list[62] = '! Карточка не создана !';
